app/controllers/blogs_controller.rb

  def index
  	@blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
  	@blog = Blog.new(blog_params)
  	if @blog.save
---
INSERT INTO "blogs" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test-name"], ["body", "test-body"], ["created_at", "2018-09-09 18:08:53.551623"], ["updated_at", "2018-09-09 18:08:53.551623"]]

  def show
  	@blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]